/*Criador de icones SVG. Cada função retorna um string contendo o código SVG do ícone correspondente.*/

const createIcon = (
    paths,
    viewBox = "0 0 24 24",
    defaults = {}
) => (
    size = 24,
    options = {}
) => {

    const config = {
        color: "currentColor",
        fill: "none",
        strokeWidth: 2,
        linecap: "round",
        linejoin: "round",
        ...defaults,
        ...options
    };

    return `
<svg xmlns="http://www.w3.org/2000/svg"
    width="${config.size}"
    height="${config.size}"
    viewBox="${viewBox}"
    fill="${config.fill}"
    stroke="${config.color}"
    stroke-width="${config.strokeWidth}"
    stroke-linecap="${config.linecap}"
    stroke-linejoin="${config.linejoin}">
    ${paths}
</svg>`;
};

window.Icons = {

    financedashboard: createIcon(`
        <!-- Vermelho -->
        <rect x="1" y="12" width="4" height="10" rx="1.2"
            fill="#EA4335" stroke="none"/>
        <rect x="6.5" y="7" width="5" height="15" rx="1.2"
            fill="#FBBC05" stroke="none"/>
        <rect x="12.5" y="1" width="5" height="21" rx="1.2"
            fill="#34A853" stroke="none"/>
        <!-- Seta azul -->
        <path
            d="M0 24
            L7.2 16.8
            L12.5 21
            L21 12.5
            L24 15.5
            V10
            H18.5
            L20.4 11.9
            L12.5 19.8
            L7.2 15.7
            L0 23"
            fill="#4285F4"
            stroke-width="3"
            stroke="#4285F4"/>
            `, "0 0 24 24", {
                size: 24,
                width: 24,
                strokeWidth: 0,
                fill: "currentColor"}),

    socialmedia: createIcon(`
        <path d="M12 18C8.68629 18 6 15.3137 6 12C6 8.68629 8.68629 6 12 6C15.3137 6 18 8.68629 18 12C18 12.7215 17.8726 13.4133 17.6392 14.054C17.5551 14.285 17.4075 14.4861 17.2268 14.6527L17.1463 14.727C16.591 15.2392 15.7573 15.3049 15.1288 14.8858C14.6735 14.5823 14.4 14.0713 14.4 13.5241V12M14.4 12C14.4 13.3255 13.3255 14.4 12 14.4C10.6745 14.4 9.6 13.3255 9.6 12C9.6 10.6745 10.6745 9.6 12 9.6C13.3255 9.6 14.4 10.6745 14.4 12Z"/>
        <path d="M7 3.33782C8.47087 2.48697 10.1786 2 12 2C17.5228 2 22 6.47715 22 12C22 17.5228 17.5228 22 12 22C6.47715 22 2 17.5228 2 12C2 10.1786 2.48697 8.47087 3.33782 7"/>
    `),

    code: createIcon(`
        <path stroke="none" d="M0 0h24v24H0z" fill="none" />
        <path d="M7 8l-4 4l4 4" />
        <path d="M17 8l4 4l-4 4" />
        <path d="M14 4l-4 16" />
        `, "0 0 24 24", {
            size: 24,
            width: 24,}),

    thread: createIcon(`
        <path d="M6.321 6.016c-.27-.18-1.166-.802-1.166-.802c.756-1.081 1.753-1.502 3.132-1.502c.975 0 1.803.327 2.394.948s.928 1.509 1.005 2.644q.492.207.905.484c1.109.745 1.719 1.86 1.719 3.137c0 2.716-2.226 5.075-6.256 5.075C4.594 16 1 13.987 1 7.994C1 2.034 4.482 0 8.044 0C9.69 0 13.55.243 15 5.036l-1.36.353C12.516 1.974 10.163 1.43 8.006 1.43c-3.565 0-5.582 2.171-5.582 6.79c0 4.143 2.254 6.343 5.63 6.343c2.777 0 4.847-1.443 4.847-3.556c0-1.438-1.208-2.127-1.27-2.127c-.236 1.234-.868 3.31-3.644 3.31c-1.618 0-3.013-1.118-3.013-2.582c0-2.09 1.984-2.847 3.55-2.847c.586 0 1.294.04 1.663.114c0-.637-.54-1.728-1.9-1.728c-1.25 0-1.566.405-1.967.868ZM8.716 8.19c-2.04 0-2.304.87-2.304 1.416c0 .878 1.043 1.168 1.6 1.168c1.02 0 2.067-.282 2.232-2.423a6.2 6.2 0 0 0-1.528-.161"/>
            `, "0 0 24 24", {
            strokeWidth: 0,
            fill: "currentColor",
            size: 34,
            width: 34,}),

    robot: createIcon(`
        <path stroke="none" d="M0 0h24v24H0z" fill="none" />
        <path d="M7 10.5c0 -.828 .746 -1.5 1.667 -1.5h6.666c.92 0 1.667 .672 1.667 1.5v3c0 .828 -.746 1.5 -1.667 1.5h-6.666c-.92 0 -1.667 -.672 -1.667 -1.5v-3" />
        <path d="M12 7v2" />
        <path d="M10 12v.01" />
        <path d="M14 12v.01" />
        <path d="M4 8v-2a2 2 0 0 1 2 -2h2" />
        <path d="M4 16v2a2 2 0 0 0 2 2h2" />
        <path d="M16 4h2a2 2 0 0 1 2 2v2" />
        <path d="M16 20h2a2 2 0 0 0 2 -2v-2" />
            `, "0 0 24 24", {
            size: 30,
            width: 30,}),

    customerservice: createIcon(`
        <path d="M8 1a5 5 0 0 0-5 5v1h1a1 1 0 0 1 1 1v3a1 1 0 0 1-1 1H3a1 1 0 0 1-1-1V6a6 6 0 1 1 12 0v6a2.5 2.5 0 0 1-2.5 2.5H9.366a1 1 0 0 1-.866.5h-1a1 1 0 1 1 0-2h1a1 1 0 0 1 .866.5H11.5A1.5 1.5 0 0 0 13 12h-1a1 1 0 0 1-1-1V8a1 1 0 0 1 1-1h1V6a5 5 0 0 0-5-5"/>
            `, "0 0 24 24", {
            size: 35,
            width: 35,
            strokeWidth: 0,
            fill: "currentColor"}),

    tool: createIcon(`
        <path d="M1 0L0 1l2.2 3.081a1 1 0 0 0 .815.419h.07a1 1 0 0 1 .708.293l2.675 2.675l-2.617 2.654A3.003 3.003 0 0 0 0 13a3 3 0 1 0 5.878-.851l2.654-2.617l.968.968l-.305.914a1 1 0 0 0 .242 1.023l3.27 3.27a.997.997 0 0 0 1.414 0l1.586-1.586a.997.997 0 0 0 0-1.414l-3.27-3.27a1 1 0 0 0-1.023-.242L10.5 9.5l-.96-.96l2.68-2.643A3.005 3.005 0 0 0 16 3q0-.405-.102-.777l-2.14 2.141L12 4l-.364-1.757L13.777.102a3 3 0 0 0-3.675 3.68L7.462 6.46L4.793 3.793a1 1 0 0 1-.293-.707v-.071a1 1 0 0 0-.419-.814zm9.646 10.646a.5.5 0 0 1 .708 0l2.914 2.915a.5.5 0 0 1-.707.707l-2.915-2.914a.5.5 0 0 1 0-.708M3 11l.471.242l.529.026l.287.445l.445.287l.026.529L5 13l-.242.471l-.026.529l-.445.287l-.287.445l-.529.026L3 15l-.471-.242L2 14.732l-.287-.445L1.268 14l-.026-.529L1 13l.242-.471l.026-.529l.445-.287l.287-.445l.529-.026z"/>
            `, "0 0 24 24", {
            size: 35,
            width: 35,
            strokeWidth: 0,
            fill: "currentColor"}),

    file: createIcon(`
        <path stroke="none" d="M0 0h24v24H0z" fill="none"/>
        <path d="M9.293 0H4a2 2 0 0 0-2 2v12a2 2 0 0 0 2 2h8a2 2 0 0 0 2-2V4.707A1 1 0 0 0 13.707 4L10 .293A1 1 0 0 0 9.293 0M9.5 3.5v-2l3 3h-2a1 1 0 0 1-1-1M4.5 9a.5.5 0 0 1 0-1h7a.5.5 0 0 1 0 1zM4 10.5a.5.5 0 0 1 .5-.5h7a.5.5 0 0 1 0 1h-7a.5.5 0 0 1-.5-.5m.5 2.5a.5.5 0 0 1 0-1h4a.5.5 0 0 1 0 1z"/>
        `, "0 0 24 24", {
            size: 35,
            width: 35,
            strokeWidth: 0,
            fill: "currentColor"})

};